hidefromkgb/rl78_geiger/src/rl78_registers.inc
// Direct access to registers in banks

.equ X0,         0xFFEF8;
.equ A0,         0xFFEF9;
.equ C0,         0xFFEFA;
.equ B0,         0xFFEFB;
.equ E0,         0xFFEFC;
.equ D0,         0xFFEFD;
.equ L0,         0xFFEFE;
.equ H0,         0xFFEFF;
.equ AX0,        0xFFEF8;
.equ BC0,        0xFFEFA;
.equ DE0,        0xFFEFC;
.equ HL0,        0xFFEFE;

.equ X1,         0xFFEF0;
.equ A1,         0xFFEF1;
.equ C1,         0xFFEF2;
.equ B1,         0xFFEF3;
.equ E1,         0xFFEF4;
.equ D1,         0xFFEF5;
.equ L1,         0xFFEF6;
.equ H1,         0xFFEF7;
.equ AX1,        0xFFEF0;
.equ BC1,        0xFFEF2;
.equ DE1,        0xFFEF4;
.equ HL1,        0xFFEF6;

.equ X2,         0xFFEE8;
.equ A2,         0xFFEE9;
.equ C2,         0xFFEEA;
.equ B2,         0xFFEEB;
.equ E2,         0xFFEEC;
.equ D2,         0xFFEED;
.equ L2,         0xFFEEE;
.equ H2,         0xFFEEF;
.equ AX2,        0xFFEE8;
.equ BC2,        0xFFEEA;
.equ DE2,        0xFFEEC;
.equ HL2,        0xFFEEE;

.equ X3,         0xFFEE0;
.equ A3,         0xFFEE1;
.equ C3,         0xFFEE2;
.equ B3,         0xFFEE3;
.equ E3,         0xFFEE4;
.equ D3,         0xFFEE5;
.equ L3,         0xFFEE6;
.equ H3,         0xFFEE7;
.equ AX3,        0xFFEE0;
.equ BC3,        0xFFEE2;
.equ DE3,        0xFFEE4;
.equ HL3,        0xFFEE6;

// Main SFR, SADDR

.equ P0,         0xFFF00;
.equ P1,         0xFFF01;
.equ P2,         0xFFF02;
.equ P3,         0xFFF03;
.equ P4,         0xFFF04;
.equ P5,         0xFFF05;
.equ P6,         0xFFF06;
.equ P7,         0xFFF07;
.equ P12,        0xFFF0C;
.equ P13,        0xFFF0D;
.equ SDR00,      0xFFF10;
.equ SIO00,      0xFFF10;
.equ TXD0,       0xFFF10;
.equ SDR01,      0xFFF12;
.equ RXD0,       0xFFF12;
.equ TDR00,      0xFFF18;
.equ TDR01,      0xFFF1A;
.equ TDR01L,     0xFFF1A;
.equ TDR01H,     0xFFF1B;
.equ ADCR,       0xFFF1E;
.equ ADCRH,      0xFFF1F;

// Main SFR, non-SADDR

.equ PM0,        0xFFF20;
.equ PM1,        0xFFF21;
.equ PM2,        0xFFF22;
.equ PM3,        0xFFF23;
.equ PM4,        0xFFF24;
.equ PM5,        0xFFF25;
.equ PM6,        0xFFF26;
.equ PM7,        0xFFF27;
.equ PM12,       0xFFF2C;
.equ ADM0,       0xFFF30;
.equ ADS,        0xFFF31;
.equ ADM1,       0xFFF32;
.equ KRCTL,      0xFFF34;
.equ KRF,        0xFFF35;
.equ KRM0,       0xFFF37;
.equ EGP0,       0xFFF38;
.equ EGN0,       0xFFF39;
.equ LCDM0,      0xFFF40;
.equ LCDM1,      0xFFF41;
.equ LCDC0,      0xFFF42;
.equ VLCD,       0xFFF43;
.equ SDR02,      0xFFF44;
.equ SIO10,      0xFFF44;
.equ TXD1,       0xFFF44;
.equ SDR03,      0xFFF46;
.equ RXD1,       0xFFF46;
.equ SDR10,      0xFFF48;
.equ TXD2,       0xFFF48;
.equ SDR11,      0xFFF4A;
.equ RXD2,       0xFFF4A;
.equ MLCD,       0xFFF4C;
.equ IICA0,      0xFFF50;
.equ IICS0,      0xFFF51;
.equ IICF0,      0xFFF52;
.equ TDR02,      0xFFF64;
.equ TDR03,      0xFFF66;
.equ TDR03L,     0xFFF66;
.equ TDR03H,     0xFFF67;
.equ TDR04,      0xFFF68;
.equ TDR05,      0xFFF6A;
.equ TDR06,      0xFFF6C;
.equ TDR07,      0xFFF6E;
.equ ITMC,       0xFFF90;
.equ SEC,        0xFFF92;
.equ MIN,        0xFFF93;
.equ HOUR,       0xFFF94;
.equ WEEK,       0xFFF95;
.equ DAY,        0xFFF96;
.equ MONTH,      0xFFF97;
.equ YEAR,       0xFFF98;
.equ ALARMWM,    0xFFF9A;
.equ ALARMWH,    0xFFF9B;
.equ ALARMWW,    0xFFF9C;
.equ RTCC0,      0xFFF9D;
.equ RTCC1,      0xFFF9E;
.equ CMC,        0xFFFA0;
.equ CSC,        0xFFFA1;
.equ OSTC,       0xFFFA2;
.equ OSTS,       0xFFFA3;
.equ CKC,        0xFFFA4;
.equ CKS0,       0xFFFA5;
.equ CKS1,       0xFFFA6;
.equ RESF,       0xFFFA8;
.equ LVIM,       0xFFFA9;
.equ LVIS,       0xFFFAA;
.equ WDTE,       0xFFFAB;
.equ CRCIN,      0xFFFAC;
.equ DSA0,       0xFFFB0;
.equ DSA1,       0xFFFB1;
.equ DRA0,       0xFFFB2;
.equ DRA0L,      0xFFFB2;
.equ DRA0H,      0xFFFB3;
.equ DRA1,       0xFFFB4;
.equ DRA1L,      0xFFFB4;
.equ DRA1H,      0xFFFB5;
.equ DBC0,       0xFFFB6;
.equ DBC0L,      0xFFFB6;
.equ DBC0H,      0xFFFB7;
.equ DBC1,       0xFFFB8;
.equ DBC1L,      0xFFFB8;
.equ DBC1H,      0xFFFB9;
.equ DMC0,       0xFFFBA;
.equ DMC1,       0xFFFBB;
.equ DRC0,       0xFFFBC;
.equ DRC1,       0xFFFBD;

// 0xFFFC0 - 0xFFFCF is empty!

.equ IF2,        0xFFFD0;
.equ IF2L,       0xFFFD0;
.equ IF2H,       0xFFFD1;
.equ IF3,        0xFFFD2;
.equ IF3L,       0xFFFD2;
.equ MK2,        0xFFFD4;
.equ MK2L,       0xFFFD4;
.equ MK2H,       0xFFFD5;
.equ MK3,        0xFFFD6;
.equ MK3L,       0xFFFD6;
.equ PR02,       0xFFFD8;
.equ PR02L,      0xFFFD8;
.equ PR02H,      0xFFFD9;
.equ PR03,       0xFFFDA;
.equ PR03L,      0xFFFDA;
.equ PR12,       0xFFFDC;
.equ PR12L,      0xFFFDC;
.equ PR12H,      0xFFFDD;
.equ PR13,       0xFFFDE;
.equ PR13L,      0xFFFDE;
.equ IF0,        0xFFFE0;
.equ IF0L,       0xFFFE0;
.equ IF0H,       0xFFFE1;
.equ IF1,        0xFFFE2;
.equ IF1L,       0xFFFE2;
.equ IF1H,       0xFFFE3;
.equ MK0,        0xFFFE4;
.equ MK0L,       0xFFFE4;
.equ MK0H,       0xFFFE5;
.equ MK1,        0xFFFE6;
.equ MK1L,       0xFFFE6;
.equ MK1H,       0xFFFE7;
.equ PR00,       0xFFFE8;
.equ PR00L,      0xFFFE8;
.equ PR00H,      0xFFFE9;
.equ PR01,       0xFFFEA;
.equ PR01L,      0xFFFEA;
.equ PR01H,      0xFFFEB;
.equ PR10,       0xFFFEC;
.equ PR10L,      0xFFFEC;
.equ PR10H,      0xFFFED;
.equ PR11,       0xFFFEE;
.equ PR11L,      0xFFFEE;
.equ PR11H,      0xFFFEF;
.equ MDAL,       0xFFFF0;
.equ MULA,       0xFFFF0;
.equ MDAH,       0xFFFF2;
.equ MULB,       0xFFFF2;
.equ MDBH,       0xFFFF4;
.equ MULOH,      0xFFFF4;
.equ MDBL,       0xFFFF6;
.equ MULOL,      0xFFFF6;
.equ PMC,        0xFFFFE;

// Second SFR

.equ ADM2,       0xF0010;
.equ ADUL,       0xF0011;
.equ ADLL,       0xF0012;
.equ ADTES,      0xF0013;
.equ PU0,        0xF0030;
.equ PU1,        0xF0031;
.equ PU2,        0xF0032;
.equ PU3,        0xF0033;
.equ PU4,        0xF0034;
.equ PU5,        0xF0035;
.equ PU7,        0xF0037;
.equ PU12,       0xF003C;
.equ PIM0,       0xF0040;
.equ PIM1,       0xF0041;
.equ PIM4,       0xF0044;
.equ PIM5,       0xF0045;
.equ POM0,       0xF0050;
.equ POM1,       0xF0051;
.equ POM4,       0xF0054;
.equ POM5,       0xF0055;
.equ PMC1,       0xF0061;
.equ PMC2,       0xF0062;
.equ PMC4,       0xF0064;
.equ NFEN0,      0xF0070;
.equ NFEN1,      0xF0071;
.equ ISC,        0xF0073;
.equ TIS0,       0xF0074;
.equ ADPC,       0xF0076;
.equ PIOR,       0xF0077;
.equ IAWCTL,     0xF0078;
.equ TOS,        0xF0079;
.equ PER1,       0xF007A;
.equ PMS,        0xF007B;
.equ PWCTKB,     0xF007C;
.equ DFLCTL,     0xF0090;
.equ HIOTRM,     0xF00A0;
.equ HOCODIV,    0xF00A8;
.equ TEMPCAL0,   0xF00AC;
.equ TEMPCAL1,   0xF00AD;
.equ TEMPCAL2,   0xF00AE;
.equ TEMPCAL3,   0xF00AF;
.equ MDCL,       0xF00E0;
.equ MDCH,       0xF00E2;
.equ MDUC,       0xF00E8;
.equ PER0,       0xF00F0;
.equ OSMC,       0xF00F3;
.equ RMC,        0xF00F4;
.equ RPECTL,     0xF00F5;
.equ PORSR,      0xF00F9;
.equ BCDADJ,     0xF00FE;
.equ SSR00,      0xF0100;
.equ SSR00L,     0xF0100;
.equ SSR01,      0xF0102;
.equ SSR01L,     0xF0102;
.equ SSR02,      0xF0104;
.equ SSR02L,     0xF0104;
.equ SSR03,      0xF0106;
.equ SSR03L,     0xF0106;
.equ SIR00,      0xF0108;
.equ SIR00L,     0xF0108;
.equ SIR01,      0xF010A;
.equ SIR01L,     0xF010A;
.equ SIR02,      0xF010C;
.equ SIR02L,     0xF010C;
.equ SIR03,      0xF010E;
.equ SIR03L,     0xF010E;
.equ SMR00,      0xF0110;
.equ SMR01,      0xF0112;
.equ SMR02,      0xF0114;
.equ SMR03,      0xF0116;
.equ SCR00,      0xF0118;
.equ SCR01,      0xF011A;
.equ SCR02,      0xF011C;
.equ SCR03,      0xF011E;
.equ SE0,        0xF0120;
.equ SE0L,       0xF0120;
.equ SS0,        0xF0122;
.equ SS0L,       0xF0122;
.equ ST0,        0xF0124;
.equ ST0L,       0xF0124;
.equ SPS0,       0xF0126;
.equ SPS0L,      0xF0126;
.equ SO0,        0xF0128;
.equ SOE0,       0xF012A;
.equ SOE0L,      0xF012A;
.equ SOL0,       0xF0134;
.equ SOL0L,      0xF0134;
.equ SSC0,       0xF0138;
.equ SSC0L,      0xF0138;
.equ SSR10,      0xF0140;
.equ SSR10L,     0xF0140;
.equ SSR11,      0xF0142;
.equ SSR11L,     0xF0142;
.equ SSR12,      0xF0144;
.equ SSR12L,     0xF0144;
.equ SSR13,      0xF0146;
.equ SSR13L,     0xF0146;
.equ SIR10,      0xF0148;
.equ SIR10L,     0xF0148;
.equ SIR11,      0xF014A;
.equ SIR11L,     0xF014A;
.equ SIR12,      0xF014C;
.equ SIR12L,     0xF014C;
.equ SIR13,      0xF014E;
.equ SIR13L,     0xF014E;
.equ SMR10,      0xF0150;
.equ SMR11,      0xF0152;
.equ SMR12,      0xF0154;
.equ SMR13,      0xF0156;
.equ SCR10,      0xF0158;
.equ SCR11,      0xF015A;
.equ SCR12,      0xF015C;
.equ SCR13,      0xF015E;
.equ SE1,        0xF0160;
.equ SE1L,       0xF0160;
.equ SS1,        0xF0162;
.equ SS1L,       0xF0162;
.equ ST1,        0xF0164;
.equ ST1L,       0xF0164;
.equ SPS1,       0xF0166;
.equ SPS1L,      0xF0166;
.equ SO1,        0xF0168;
.equ SOE1,       0xF016A;
.equ SOE1L,      0xF016A;
.equ SOL1,       0xF0174;
.equ SOL1L,      0xF0174;
.equ SSC1,       0xF0178;
.equ SSC1L,      0xF0178;
.equ TCR00,      0xF0180;
.equ TCR01,      0xF0182;
.equ TCR02,      0xF0184;
.equ TCR03,      0xF0186;
.equ TCR04,      0xF0188;
.equ TCR05,      0xF018A;
.equ TCR06,      0xF018C;
.equ TCR07,      0xF018E;
.equ TMR00,      0xF0190;
.equ TMR01,      0xF0192;
.equ TMR02,      0xF0194;
.equ TMR03,      0xF0196;
.equ TMR04,      0xF0198;
.equ TMR05,      0xF019A;
.equ TMR06,      0xF019C;
.equ TMR07,      0xF019E;
.equ TSR00,      0xF01A0;
.equ TSR00L,     0xF01A0;
.equ TSR01,      0xF01A2;
.equ TSR01L,     0xF01A2;
.equ TSR02,      0xF01A4;
.equ TSR02L,     0xF01A4;
.equ TSR03,      0xF01A6;
.equ TSR03L,     0xF01A6;
.equ TSR04,      0xF01A8;
.equ TSR04L,     0xF01A8;
.equ TSR05,      0xF01AA;
.equ TSR05L,     0xF01AA;
.equ TSR06,      0xF01AC;
.equ TSR06L,     0xF01AC;
.equ TSR07,      0xF01AE;
.equ TSR07L,     0xF01AE;
.equ TE0,        0xF01B0;
.equ TE0L,       0xF01B0;
.equ TS0,        0xF01B2;
.equ TS0L,       0xF01B2;
.equ TT0,        0xF01B4;
.equ TT0L,       0xF01B4;
.equ TPS0,       0xF01B6;
.equ TO0,        0xF01B8;
.equ TO0L,       0xF01B8;
.equ TOE0,       0xF01BA;
.equ TOE0L,      0xF01BA;
.equ TOL0,       0xF01BC;
.equ TOL0L,      0xF01BC;
.equ TOM0,       0xF01BE;
.equ TOM0L,      0xF01BE;
.equ DSA2,       0xF0200;
.equ DSA3,       0xF0201;
.equ DRA2,       0xF0202;
.equ DRA2L,      0xF0202;
.equ DRA2H,      0xF0203;
.equ DRA3,       0xF0204;
.equ DRA3L,      0xF0204;
.equ DRA3H,      0xF0205;
.equ DBC2,       0xF0206;
.equ DBC2L,      0xF0206;
.equ DBC2H,      0xF0207;
.equ DBC3,       0xF0208;
.equ DBC3L,      0xF0208;
.equ DBC3H,      0xF0209;
.equ DMC2,       0xF020A;
.equ DMC3,       0xF020B;
.equ DRC2,       0xF020C;
.equ DRC3,       0xF020D;
.equ IICCTL00,   0xF0230;
.equ IICCTL01,   0xF0231;
.equ IICWL0,     0xF0232;
.equ IICWH0,     0xF0233;
.equ SVA0,       0xF0234;
.equ ELSELR00,   0xF0240;
.equ ELSELR01,   0xF0241;
.equ ELSELR02,   0xF0242;
.equ ELSELR03,   0xF0243;
.equ ELSELR04,   0xF0244;
.equ ELSELR05,   0xF0245;
.equ ELSELR06,   0xF0246;
.equ ELSELR07,   0xF0247;
.equ ELSELR08,   0xF0248;
.equ ELSELR09,   0xF0249;
.equ CRC0CTL,    0xF02F0;
.equ PGCRCL,     0xF02F2;
.equ CRCD,       0xF02FA;
.equ PFSEG0,     0xF0300;
.equ PFSEG1,     0xF0301;
.equ PFSEG2,     0xF0302;
.equ PFSEG3,     0xF0303;
.equ PFSEG4,     0xF0304;
.equ PFSEG5,     0xF0305;
.equ PFSEG6,     0xF0306;
.equ ISCLCD,     0xF0308;
.equ SUBCUD,     0xF0310;
.equ COMPMDR,    0xF0340;
.equ COMPFIR,    0xF0341;
.equ COMPOCR,    0xF0342;
.equ SEG0,       0xF0400;
.equ SEG1,       0xF0401;
.equ SEG2,       0xF0402;
.equ SEG3,       0xF0403;
.equ SEG4,       0xF0404;
.equ SEG5,       0xF0405;
.equ SEG6,       0xF0406;
.equ SEG7,       0xF0407;
.equ SEG8,       0xF0408;
.equ SEG9,       0xF0409;
.equ SEG10,      0xF040A;
.equ SEG11,      0xF040B;
.equ SEG12,      0xF040C;
.equ SEG13,      0xF040D;
.equ SEG14,      0xF040E;
.equ SEG15,      0xF040F;
.equ SEG16,      0xF0410;
.equ SEG17,      0xF0411;
.equ SEG18,      0xF0412;
.equ SEG19,      0xF0413;
.equ SEG20,      0xF0414;
.equ SEG21,      0xF0415;
.equ SEG22,      0xF0416;
.equ SEG23,      0xF0417;
.equ SEG24,      0xF0418;
.equ SEG25,      0xF0419;
.equ SEG26,      0xF041B;
.equ SEG27,      0xF041C;
.equ SEG28,      0xF041D;
.equ SEG29,      0xF041E;
.equ SEG30,      0xF041F;
.equ SEG31,      0xF0420;
.equ SEG32,      0xF0421;
.equ SEG33,      0xF0422;
.equ SEG34,      0xF0423;
.equ SEG35,      0xF0424;
.equ SEG36,      0xF0425;
.equ SEG37,      0xF0426;
.equ SEG38,      0xF0427;
.equ SEG39,      0xF0428;
.equ SEG40,      0xF0429;
.equ SEG41,      0xF042A;
.equ SEG42,      0xF042B;
.equ SEG43,      0xF042C;
.equ SEG44,      0xF042D;
.equ SEG45,      0xF042E;
.equ SEG46,      0xF042F;
.equ SEG47,      0xF0430;
.equ SEG48,      0xF0431;
.equ SEG49,      0xF0432;
.equ SEG50,      0xF0433;
.equ TKBCR00,    0xF0500;
.equ TKBCR01,    0xF0502;
.equ TKBCR02,    0xF0504;
.equ TKBCR03,    0xF0506;
.equ TKBSIR00,   0xF050A;
.equ TKBSIR01,   0xF050C;
.equ TKBDNR00,   0xF050E;
.equ TKBSSR00,   0xF050F;
.equ TKBDNR01,   0xF0510;
.equ TKBSSR01,   0xF0511;
.equ TKBTRG0,    0xF0512;
.equ TKBFLG0,    0xF0513;
.equ TKBCRLD00,  0xF0514;
.equ TKBCRLD01,  0xF0516;
.equ TKBCNT0,    0xF0520;
.equ TKBCTL00,   0xF0522;
.equ TKBMFR0,    0xF0524;
.equ TKBIOC00,   0xF0526;
.equ TKBCLR0,    0xF0527;
.equ TKBIOC01,   0xF0528;
.equ TKBCTL01,   0xF0529;
.equ TKBPSCS0,   0xF052A;
.equ TKBPACTL00, 0xF0530;
.equ TKBPACTL01, 0xF0532;
.equ TKBPAHFS0,  0xF0534;
.equ TKBPAHFT0,  0xF0535;
.equ TKBPAFLG0,  0xF0536;
.equ TKBPACTL02, 0xF0537;
